# JavaExternal_06_03_2018
Repository for EPAM projects

# Lesson1

1)Используя циклы и метод: 
	System.out.print("* "), System.out.print("  "),
	System.out.print("\n") 
	(для перехода на новую строку).  
	Выведите на экран: 
	· прямоугольник 
	· прямоугольный треугольник  
	· равносторонний треугольник   
	· ромб
2)Сортировка последовательности  
  1. Упорядочить одномерный масиве вначале отрицательные по возрастанию
   затем положительные по убыванию.
  2. В одномерном массиве сначала положительные потом отрицательные за О(n).
3)Дана целочисленная прямоугольная матрица. 
  1. Упорядочить столбцы по убыванию среднего значения. 
  2. Упорядочить строки, по возрастанию по самой длинной серии одинаковых элементов.
  3. Дана квадратная матрица A порядка M (M — нечетное число). Начиная с элемента A1,1 и перемещаясь по часовой стрелке, вывести все ее   элементы по спирали: первая строка, последний столбец, последняя строка в обратном  порядке,  первый  столбец  в  обратном  порядке,  оставшиеся  элементы второй строки и т. д.; последним выводится центральный элемент матрицы.

# Lesson2

1) создать динамический массив из разных фигур и вывести информацию на экран
2) создать класс Polygon для описания фигур разной размерности

# Lesson3

Создать абстрактный класс CVehicle.На его основе реализовать классы CPlane, CCar и CShip. Классы должны иметь возможность задавать и получать координаты, параметры средств(цена, скорость, год выпуска). Для самолета должна быть определена высота, для самолета и корабля - количество пассажиров. Для корабля - порт приписки.
Написать программу, создающую список объектов этих классов в динамической памяти. Программа должна содержать меню, позволяющее проверитку всех методов классов.
  1. Vehicle с наибольшей ценой
  2. Найти механизм год выпуска 2000-2005 со  скоростью выше 150 км\ч, и наименьшей ценой
  3. Из Масива Vehicle получить масив Car не старше 5 лет
  4. Из Масива Vehicle получить масив Ship не старше 5 лет, с  отсортированой ценой по убыванию

# Lesson4
  
1) Добавить машину Амфибию, БетМобиль
2) добавляем 3 интерфейса IFly, ISwim, IMove
3) Создать 3 последовательности  IFly, ISwim, IMove(уточнить) в рамках каждой последовательности упорядочить по скорости
4) Создать методы Мин и Макс